konradmb/Licznikoinator-ESP8266/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include "WiFiSettings.h"
#include "MeterConnection.h"

const char *ssid = STASSID;
const char *password = STAPSK;

ESP8266WebServer server(80);

const int led = 2;

void handleRoot()
{
  digitalWrite(led, 0);
  String toSend = String("hello from esp8266! \n");
  toSend.concat(meterRead());
  server.send(200, "text/plain", toSend);
  digitalWrite(led, 1);
}

void blink(int pin, int delayMs = 3000)
{
  pinMode(pin, OUTPUT);
  digitalWrite(pin, HIGH);
  delay(delayMs);
  digitalWrite(pin, LOW);
}

void handleNotFound()
{
  digitalWrite(led, 1);
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
  digitalWrite(led, 1);
}

void setup(void)
{
  pinMode(led, OUTPUT);
  digitalWrite(led, 1);
  Serial.begin(115200);
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  Serial.println("");

  // Wait for connection
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print(".");
  }
  Serial.println("");
  Serial.print("Connected to ");
  Serial.println(ssid);
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  if (MDNS.begin("esp8266"))
  {
    Serial.println("MDNS responder started");
  }

  server.on("/", handleRoot);

  server.on("/inline", []() {
    server.send(200, "text/plain", "this works as well");
  });

  server.on("/blink", []() {
    blink(5);
    server.send(200, "text/plain", "Blink");
  });

  char *WiFiStatusLabel[] =
      {"WL_IDLE_STATUS",
       "WL_NO_SSID_AVAIL",
       "WL_SCAN_COMPLETED",
       "WL_CONNECTED",
       "WL_CONNECT_FAILED",
       "WL_CONNECTION_LOST",
       "WL_DISCONNECTED"};

  server.on("/info", [=]() {
    String toSend = "WiFi.status(): ";
    toSend += WiFiStatusLabel[WiFi.status()];
    server.send(200, "text/plain", toSend);
  });

  server.onNotFound(handleNotFound);

  server.begin();
  Serial.println("HTTP server started");
}

void loop(void)
{
  server.handleClient();
  MDNS.update();
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print(".");
  }
}